


#                       _ooOoo_
#                      o8888888o
#                      88" . "88
#                      (| -_- |)
#                      O\  =  /O
#                   ____/`---'\____
#                 .'  \\|     |//  `.
#                /  \\|||  :  |||//  \
#               /  _||||| -:- |||||-  \
#               |   | \\\  -  /// |   |
#               | \_|  ''\---/''  |   |
#               \  .-\__  `-`  ___/-. /
#             ___`. .'  /--.--\  `. . __
#          ."" '<  `.___\_<|>_/___.'  >'"".
#         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
#         \  \ `-.   \_ __\ /__ _/   .-` /  /
#    ======`-.____`-.___\_____/___.-`____.-'======
#                       `=---='
#   ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
#             佛祖保佑代码无错按我的想法执行

class_name 状态机2
extends Node

@onready var 站立: Node = $"静止"

var 状态时长 : float

@export var 当前状态节点 : 状态节点
@export var 当前状态名称 : String = "静止"

func  _ready() -> void:
	切换状态(当前状态名称)

func _process(delta: float) -> void:
		
	if 当前状态节点 != null:
		当前状态节点.更新(delta)
		var 跳转目标动画 : String = 当前状态节点.跳转条件()
		if not 跳转目标动画.is_empty():
			切换状态(跳转目标动画)

func _physics_process(delta: float) -> void:
	if 当前状态节点 != null:
		当前状态节点.物理更新(delta)
		
	状态时长 += delta
	
func 切换状态(状态名称 : String) -> bool:
	var 子节点 : Node = get_node(状态名称)
		
	if 子节点 is 状态节点:
		if 当前状态节点 != null:
			当前状态节点.状态退出()
			
		子节点.状态进入()
		当前状态节点 = 子节点
		
		return true
	return false
	
	状态时长 = 0
